In [17]:
dictonary = [{'Name':'Chandan', 'Marks': [50,60,70]}, 
    {'Name': 'A', 'Marks': [40,60,70]}, 
    {'Name': 'B', 'Marks': [60,60,70]}]

 #calling lambda function to find average 
    

key = lambda x : sum(x) / len(x)
print(key([10,20,30]))


# finding marks using lambda funtoion inside dictonary
lambdaDict = {'Average' : lambda x : sum(x) / len(x)}

20.0

In [18]:
MaxOfMarks = {'Maximum' : lambda x : max(x), 'Third': lambda x : x[2]}

In [19]:
MaxOfMarks

{'Maximum': <function __main__.<lambda>(x)>,
 'Third': <function __main__.<lambda>(x)>}

In [23]:
for data in dictonary:
    print(data['Name'],data['Marks'])
    print(lambdaDict['Average'](data['Marks']))
    print(MaxOfMarks['Maximum'](data['Marks']))

Chandan [50, 60, 70]
60.0
70
A [40, 60, 70]
56.666666666666664
70
B [60, 60, 70]
63.333333333333336
70

In [24]:
def userinfo(*args):
    print(args)
userinfo("cahdan","hfkdvsg",6876)

('cahdan', 'hfkdvsg', 6876)

In [29]:
def userinfo(**kwargs):
    print(kwargs)
userinfo(age = 20)

{'age': 20}

In [33]:
def userinfo(*args, **kwargs):
    print(args,kwargs)
userinfo(10,30,20, age=20)

(10, 30, 20) {'age': 20}

In [52]:
def UserSignUP(username, userList=[]):
    userList.append(username)
    print(userList)
    print(id(userList))
    
UserSignUP('Tusar',['hi'])
UserSignUP('Aditya',['hii','hf'])

['hi', 'Tusar']
1376838575232
['hii', 'hf', 'Aditya']
1376838584384

In [58]:
def func(x,y,z):
    print(x)
    print(x,y,z)
a= (10,20,30)
func(*a) # accessing multiple value us

10
10 20 30

In [1]:
import numpy as np
a = list(map(int, input().strip().split(" ")))
b = list(map(int,input().strip().split(" ")))
arr1 = np.array(a).reshape(2,2)
arr2 = np.array(b).reshape(2,2)

print('Addition of Two Arrays:')

print(np.add(arr1,arr2))

print('Square root of Matrix-1 elements:')
print(np.sqrt(arr1))

print('Square root of Matrix-2 elements:')
print(np.sqrt(arr2))

print('Transpose of Matrix-1:')
print(np.transpose(arr1))

print('Transpose of Matrix-2:')
print(np.transpose(arr2))

1 1 1 1
2 2 2 2
Addition of Two Arrays:
[[3 3]
 [3 3]]
Square root of Matrix-1 elements:
[[1. 1.]
 [1. 1.]]
Square root of Matrix-2 elements:
[[1.41421356 1.41421356]
 [1.41421356 1.41421356]]
Transpose of Matrix-1:
[[1 1]
 [1 1]]
Transpose of Matrix-2:
[[2 2]
 [2 2]]

In [6]:
import pandas as pd
l1=list(str(num) for num in input("").strip().split())[:5]
l2=list(str(num) for num in input("").strip().split())[:5]
l3=list(str(num) for num in input("").strip().split())[:5]
l4=list(str(num) for num in input("").strip().split())[:5]
l5=list(str(num) for num in input("").strip().split())[:5]
l6=list(str(num) for num in input("").strip().split())[:5]

df = pd.DataFrame([l1,l2,l3,l4,l5,l6],index = ['a','b','c','d','e','f'], columns = ['P','Q','R','S','T'])
print('After removing first 3 rows')
print(df.iloc[3:])

print('After removing last 3 rows')
print(df.iloc[3:])

1 2 3 4 5
5 4 3 2 1
5 3 2 1 4
3 5 4 2 1
4 3 5 2 1
1 5 4 3 2
After removing first 3 rows
   P  Q  R  S  T
d  3  5  4  2  1
e  4  3  5  2  1
f  1  5  4  3  2
After removing last 3 rows
   P  Q  R  S  T
d  3  5  4  2  1
e  4  3  5  2  1
f  1  5  4  3  2

In [3]:
import numpy as np
np.linspace(2,10,5)

array([ 2.,  4.,  6.,  8., 10.])

In [4]:
var = 'THis is a datascience'
arr = np.fromiter(var,dtype='U2')
arr

array(['T', 'H', 'i', 's', ' ', 'i', 's', ' ', 'a', ' ', 'd', 'a', 't',
       'a', 's', 'c', 'i', 'e', 'n', 'c', 'e'], dtype='<U2')

In [6]:
b = np.array([[5,5],[4,5],[16,4]])
s = b.sum(-1)
print(s)
print(b[s%10==0])

[10  9 20]
[[ 5  5]
 [16  4]]

In [5]:
def RL(x):
    if x == 'I':
        return 1
    elif x == 'V':
        return 2
    elif x == 'X':
        return 10
    elif x == 'L':
        return 50
    elif x == 'C':
        return 100
    elif x == 'D':
        return 500
    return -1

    
def RomToInt(str):
    a =0
    i =0
    while(i<len(str)):
        X1 = RL(str[i])
        if (i+1<len(str)):
            X2 = RL(str[i+1])
            if X1 >= X2:
                a = a+10
                i = i+1
            else:
                a = a +X2
                i = i+1
        else:
            a = a+X1
            i = i + 1

print(RomToInt('V'))

None

In [1]:
import sys
sys.stdout.write("hello world")

hello world

11

In [2]:
x = [[0], [1]]

print((' '.join(list(map(str, x))),))

('[0] [1]',)

In [7]:
import sys

eval(sys.stdin.readline())

SyntaxError: unexpected EOF while parsing (<string>, line 0)

In [8]:
import numpy as np

a = np.array([1, 2, 3])

b = np.array([4, 5, 6])

c = np.outer(a, b)

print(c)

[[ 4  5  6]
 [ 8 10 12]
 [12 15 18]]

In [9]:
m=reduce(lambda x: x-3 in range(4, 10))

print(list(m))

NameError: name 'reduce' is not defined

In [10]:
import numpy as np

a = np.array([1, 2, 3])

b = np.array([4, 5, 6])

c = a + b

print(c * 2)

[10 14 18]

In [11]:
import numpy as np

a = np.array([[1, 2], [3, 4]])

b = np.array([1, 2])

c = a + b

print(c)

[[2 4]
 [4 6]]

In [12]:
import pandas as pd
data = {'name': ['John', 'Mary', 'Jack', 'Tom', 'Lisa'], 
        'age': [28, 30, 35, 40, 28], 
        'city': ['London', 'Rome', 'Paris', 'Berlin', 'London']}
df = pd.DataFrame(data)

In [13]:
df.head(3)

   name  age    city
0  John   28  London
1  Mary   30    Rome
2  Jack   35   Paris

In [14]:
df.describe()

             age
count   5.000000
mean   32.200000
std     5.215362
min    28.000000
25%    28.000000
50%    30.000000
75%    35.000000
max    40.000000

In [16]:
def get_country(city):
    if city == 'London':
        return 'England'
    elif city == 'Paris':
        return 'France'
    else:
        return 'Unknown' 

df['Country'] = df['city'].apply(get_country)

In [17]:
df

   name  age    city  Country
0  John   28  London  England
1  Mary   30    Rome  Unknown
2  Jack   35   Paris   France
3   Tom   40  Berlin  Unknown
4  Lisa   28  London  England

In [33]:
import pandas as pd

data = {
    'Date': ['2023-01-01', '2023-01-01', '2023-01-01', '2023-01-01', '2023-01-01'] * 20 + 
           ['2023-01-02', '2023-01-02', '2023-01-02', '2023-01-02', '2023-01-02'] * 20 + 
           ['2023-01-03', '2023-01-03', '2023-01-03', '2023-01-03', '2023-01-03'] * 20,
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'] * 60,
    'MaxTemp': [32, 75, 30, 65, 70] * 20 + [30, 73, 28, 63, 68] * 20 + [34, 77, 32, 67, 72] * 20,
    'MinTemp': [25, 58, 20, 40, 45] * 20 + [23, 56, 18, 38, 43] * 20 + [27, 60, 22, 42, 47] * 20
}

df = pd.DataFrame(data)

In [36]:
dataframe = df.copy()

In [37]:
dataframe['Daily Temperarture Range'] = dataframe['MaxTemp']-dataframe['MinTemp']
dataframe

           Date         City  MaxTemp  MinTemp  Daily Temperarture Range
0    2023-01-01     New York       32       25                         7
1    2023-01-01  Los Angeles       75       58                        17
2    2023-01-01      Chicago       30       20                        10
3    2023-01-01      Houston       65       40                        25
4    2023-01-01      Phoenix       70       45                        25
..          ...          ...      ...      ...                       ...
295  2023-01-03     New York       34       27                         7
296  2023-01-03  Los Angeles       77       60                        17
297  2023-01-03      Chicago       32       22                        10
298  2023-01-03      Houston       67       42                        25
299  2023-01-03      Phoenix       72       47                        25

[300 rows x 5 columns]

In [38]:
dataframe = dataframe.groupby('City')
avg_daily_temp = dataframe['Daily Temperarture Range'].mean().reset_index()
avg_daily_temp

          City  Daily Temperarture Range
0      Chicago                      10.0
1      Houston                      25.0
2  Los Angeles                      17.0
3     New York                       7.0
4      Phoenix                      25.0

In [39]:
highest_temp = dataframe['MaxTemp'].idxmax()
highest_temp

City
Chicago        202
Houston        203
Los Angeles    201
New York       200
Phoenix        204
Name: MaxTemp, dtype: int64

In [40]:
highest_temp_date = dataframe.iloc[highest_temp, ['City', 'Date', 'MaxTemp']].reset_index(drop=True)
highest_temp_date

AttributeError: 'DataFrameGroupBy' object has no attribute 'iloc'

In [ ]:
def analyze_weather_data(dataframe):
    # Calculate the difference between the maximum and minimum temperature for each city on each day
    dataframe['DailyTempRange'] = dataframe['MaxTemp'] - dataframe['MinTemp']

    # Group the data by city
    grouped_df = dataframe.groupby('City')

    # Calculate the average daily temperature range for each city
    avg_temp_range = grouped_df['DailyTempRange'].mean().reset_index()

    # Find the highest temperature and the corresponding date for each city
    highest_temp = grouped_df['MaxTemp'].idxmax()
    highest_temp_date = dataframe.loc[highest_temp, ['City', 'Date', 'MaxTemp']].reset_index(drop=True)

    # Find the lowest temperature and the corresponding date for each city
    lowest_temp = grouped_df['MinTemp'].idxmin()
    lowest_temp_date = dataframe.loc[lowest_temp, ['City', 'Date', 'MinTemp']].reset_index(drop=True)

    # Merge the dataframes together
    result_df = avg_temp_range.merge(highest_temp_date, on='City').merge(lowest_temp_date, on='City')

    # Rename the columns
    result_df.columns = ['City', 'Average Daily Temp Range', 'Highest Temp Date', 'Highest Temp', 'Lowest Temp Date', 'Lowest Temp']

    # Sort the resulting DataFrame by the average daily temperature range in descending order
    sorted_df = result_df.sort_values(by='Average Daily Temp Range', ascending=False)

    # Print the resulting DataFrame
    print(sorted_df)

analyze_weather_data(df)